<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Aggregating-and-Combining-pandas-DataFrames" data-toc-modified-id="Aggregating-and-Combining-pandas-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Aggregating and Combining <code>pandas</code> DataFrames</a></span><ul class="toc-item"><li><span><a href="#Objectives" data-toc-modified-id="Objectives-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Objectives</a></span></li></ul></li><li><span><a href="#Loading-Example-Data:-Austin-Animal-Center-Data" data-toc-modified-id="Loading-Example-Data:-Austin-Animal-Center-Data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Loading Example Data: Austin Animal Center Data</a></span></li><li><span><a href="#Aggregating-over-DataFrames:-.groupby()" data-toc-modified-id="Aggregating-over-DataFrames:-.groupby()-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Aggregating over DataFrames: <code>.groupby()</code></a></span><ul class="toc-item"><li><span><a href="#.groups-and-.get_group()" data-toc-modified-id=".groups-and-.get_group()-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span><code>.groups</code> and <code>.get_group()</code></a></span><ul class="toc-item"><li><span><a href="#Multi-Indexing" data-toc-modified-id="Multi-Indexing-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>Multi-Indexing</a></span></li></ul></li><li><span><a href="#Aggregating" data-toc-modified-id="Aggregating-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Aggregating</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Pivoting-a-DataFrame" data-toc-modified-id="Pivoting-a-DataFrame-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Pivoting a DataFrame</a></span><ul class="toc-item"><li><span><a href="#.pivot_table()" data-toc-modified-id=".pivot_table()-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span><code>.pivot_table()</code></a></span><ul class="toc-item"><li><span><a href="#Example" data-toc-modified-id="Example-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>Example</a></span></li><li><span><a href="#Back-to-Austin-animals" data-toc-modified-id="Back-to-Austin-animals-4.1.2"><span class="toc-item-num">4.1.2&nbsp;&nbsp;</span>Back to Austin animals</a></span></li></ul></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()" data-toc-modified-id="Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Methods for Combining DataFrames: <code>.join()</code>, <code>.merge()</code>, <code>pd.concat()</code></a></span><ul class="toc-item"><li><span><a href="#.join()" data-toc-modified-id=".join()-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span><code>.join()</code></a></span></li><li><span><a href="#.merge()" data-toc-modified-id=".merge()-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span><code>.merge()</code></a></span></li><li><span><a href="#The-how-Parameter" data-toc-modified-id="The-how-Parameter-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>The <code>how</code> Parameter</a></span></li><li><span><a href="#pd.concat()" data-toc-modified-id="pd.concat()-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span><code>pd.concat()</code></a></span></li></ul></li><li><span><a href="#King-County-Assessments" data-toc-modified-id="King-County-Assessments-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>King County Assessments</a></span><ul class="toc-item"><li><span><a href="#First,-get-the-data!" data-toc-modified-id="First,-get-the-data!-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>First, get the data!</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Time-Permitting:-Data-Cleaning-Exercises-with-Pandas" data-toc-modified-id="Time-Permitting:-Data-Cleaning-Exercises-with-Pandas-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Time Permitting: Data Cleaning Exercises with Pandas</a></span><ul class="toc-item"><li><span><a href="#Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns." data-toc-modified-id="Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns.-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.</a></span></li><li><span><a href="#Investigate-and-handle-non-numeric-ZipCode-values" data-toc-modified-id="Investigate-and-handle-non-numeric-ZipCode-values-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Investigate and handle non-numeric ZipCode values</a></span></li><li><span><a href="#Add-a-column-for-PricePerSqFt" data-toc-modified-id="Add-a-column-for-PricePerSqFt-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>Add a column for PricePerSqFt</a></span></li><li><span><a href="#Subset-the-data-to-2021-sales-only" data-toc-modified-id="Subset-the-data-to-2021-sales-only-7.4"><span class="toc-item-num">7.4&nbsp;&nbsp;</span>Subset the data to 2021 sales only</a></span></li><li><span><a href="#What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?" data-toc-modified-id="What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?-7.5"><span class="toc-item-num">7.5&nbsp;&nbsp;</span>What is the mean price per square foot for a house sold in Seattle in 2021?</a></span></li></ul></li><li><span><a href="#Level-Up:-pandas.set_option()" data-toc-modified-id="Level-Up:-pandas.set_option()-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Level Up: <code>pandas.set_option()</code></a></span><ul class="toc-item"><li><span><a href="#Block-Scientific-Notation" data-toc-modified-id="Block-Scientific-Notation-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Block Scientific Notation</a></span></li><li><span><a href="#See-More-Rows" data-toc-modified-id="See-More-Rows-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>See More Rows</a></span></li></ul></li></ul></div>

In [20]:
import pandas as pd
import numpy as np
import requests as rq
from sklearn.preprocessing import OneHotEncoder
from zipfile import ZipFile

# Aggregating and Combining `pandas` DataFrames

## Objectives

- Use GroupBy objects to organize and aggregate data
- Create pivot tables from DataFrames
- Combine DataFrames by merging and appending

We'll work with the Austin Animal Center dataset and with data from King County's Department of Assessments (Seattle housing data).

# Loading Example Data: Austin Animal Center Data

In [21]:
data = rq.get('https://data.austintexas.gov/resource/9t4d-g238.json').text

In [22]:
animals = pd.read_json(data)

In [23]:
animals.head()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A849585,A849585,2022-01-18 09:27:00,2022-01-18T09:27:00.000,2021-07-10T00:00:00.000,Euthanasia,Suffering,Cat,Neutered Male,NULL,Domestic Shorthair Mix,Black/White
1,A821894,*Winston,2022-01-18 08:56:00,2022-01-18T08:56:00.000,2018-08-21T00:00:00.000,Adoption,Foster,Dog,Neutered Male,3 years,Boxer Mix,Brown Brindle/White
2,A845105,Widge,2022-01-18 08:15:00,2022-01-18T08:15:00.000,2013-10-25T00:00:00.000,Adoption,Foster,Cat,Spayed Female,8 years,Domestic Shorthair,Brown Tabby
3,A849826,NaN,2022-01-17 18:00:00,2022-01-17T18:00:00.000,2021-01-13T00:00:00.000,Euthanasia,Suffering,Cat,Spayed Female,1 year,Domestic Longhair Mix,Black
4,A849335,NaN,2022-01-17 14:23:00,2022-01-17T14:23:00.000,2021-08-06T00:00:00.000,Transfer,Partner,Dog,Intact Male,NULL,Border Collie,Black/White

# Aggregating over DataFrames: `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. (And if you haven't, you'll see it very soon!) Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [24]:
animals.groupby('animal_type')

In [25]:
animals.columns

Index(['animal_id', 'name', 'datetime', 'monthyear', 'date_of_birth',
       'outcome_type', 'outcome_subtype', 'animal_type', 'sex_upon_outcome',
       'age_upon_outcome', 'breed', 'color'],
      dtype='object')

We can group by multiple columns, and also return a DataFrameGroupBy object

Notice the object type [DataFrameGroupBy](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) object.

## `.groups` and `.get_group()`

In [26]:
# This retuns each group indexed by the group name, e.g. 'Bird',
# along with the row indices of each value

animals.groupby('animal_type').groups

{'Cat': [0, 2, 3, 7, 8, 10, 21, 22, 27, 28, 30, 32, 36, 37, 41, 44, 47, 48, 49, 50, 56, 57, 58, 59, 61, 67, 72, 74, 76, 80, 81, 85, 90, 98, 100, 109, 114, 115, 117, 118, 119, 129, 130, 131, 133, 134, 136, 141, 151, 152, 155, 157, 158, 159, 165, 166, 167, 169, 170, 171, 174, 175, 176, 177, 178, 179, 185, 193, 199, 202, 203, 207, 209, 210, 213, 215, 217, 218, 219, 222, 225, 228, 231, 233, 242, 243, 244, 247, 250, 251, 258, 260, 266, 268, 269, 272, 273, 274, 275, 276, ...], 'Dog': [1, 4, 5, 6, 9, 11, 12, 13, 14, 15, 17, 19, 20, 23, 24, 25, 26, 29, 31, 33, 34, 35, 38, 39, 40, 42, 43, 45, 46, 51, 52, 53, 54, 55, 60, 62, 63, 64, 65, 66, 68, 69, 70, 71, 73, 75, 77, 78, 79, 82, 83, 84, 86, 87, 88, 89, 91, 92, 93, 94, 95, 97, 99, 101, 102, 103, 104, 105, 106, 107, 108, 110, 111, 112, 113, 116, 120, 121, 122, 123, 124, 125, 126, 127, 128, 135, 137, 138, 139, 140, 142, 143, 144, 145, 146, 147, 148, 149, 150, 153, ...], 'Other': [16, 18, 96, 132, 168, 224, 238, 239, 248, 252, 262, 356, 358, 372, 373, 396, 471, 477, 524, 527, 554, 559, 560, 601, 602, 603, 604, 607, 608, 762, 831, 846, 871, 872, 875, 879]}

Once we know we are working with a type of object, it opens up a suite of attributes and methods. One attribute we can look at is groups.

In [27]:
# Once we know the group indices, we can return the groups using those indices.
animals.groupby('animal_type').get_group('Dog')

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
1,A821894,*Winston,2022-01-18 08:56:00,2022-01-18T08:56:00.000,2018-08-21T00:00:00.000,Adoption,Foster,Dog,Neutered Male,3 years,Boxer Mix,Brown Brindle/White
4,A849335,NaN,2022-01-17 14:23:00,2022-01-17T14:23:00.000,2021-08-06T00:00:00.000,Transfer,Partner,Dog,Intact Male,NULL,Border Collie,Black/White
5,A849779,A849779,2022-01-17 12:00:00,2022-01-17T12:00:00.000,2021-11-25T00:00:00.000,Transfer,Partner,Dog,Intact Male,1 month,Boxer Mix,White/Black
6,A849798,NaN,2022-01-17 10:38:00,2022-01-17T10:38:00.000,2020-07-13T00:00:00.000,Euthanasia,Suffering,Dog,Intact Male,1 year,German Shepherd Mix,Black/White
9,A848419,*Mistletoe,2022-01-16 17:48:00,2022-01-16T17:48:00.000,2020-12-20T00:00:00.000,Adoption,NaN,Dog,Spayed Female,1 year,Pit Bull Mix,Blue/White
...,...,...,...,...,...,...,...,...,...,...,...,...
991,A847198,*Bruiser,2021-12-19 17:41:00,2021-12-19T17:41:00.000,2020-11-28T00:00:00.000,Adoption,NaN,Dog,Neutered Male,1 year,Pit Bull,Brown
993,A846359,*Bellamy,2021-12-19 17:28:00,2021-12-19T17:28:00.000,2019-11-14T00:00:00.000,Adoption,NaN,Dog,Spayed Female,2 years,Pit Bull,White/Gray
994,A848017,Rice Krispie,2021-12-19 15:56:00,2021-12-19T15:56:00.000,2019-07-13T00:00:00.000,Adoption,NaN,Dog,Intact Male,2 years,Kuvasz,White
997,A837307,Blue,2021-12-19 15:22:00,2021-12-19T15:22:00.000,2020-06-21T00:00:00.000,Adoption,NaN,Dog,Spayed Female,1 year,Labrador Retriever/Pointer,Black/White
999,A847828,*Subaru,2021-12-19 15:17:00,2021-12-19T15:17:00.000,2020-12-09T00:00:00.000,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair/Beagle,Brown

### Multi-Indexing

In [28]:
# Same goes for multi-index groupbys
animal_outcome = animals.groupby(['animal_type', 'outcome_type'])
animal_outcome.groups

{('Cat', 'Adoption'): [2, 10, 21, 22, 28, 30, 32, 36, 37, 41, 44, 47, 48, 49, 50, 56, 57, 58, 59, 61, 67, 72, 74, 76, 80, 81, 85, 90, 98, 100, 109, 115, 130, 131, 133, 136, 151, 152, 155, 157, 158, 159, 165, 166, 167, 169, 170, 171, 178, 193, 199, 203, 210, 213, 215, 217, 218, 219, 222, 242, 244, 247, 250, 251, 258, 260, 266, 268, 272, 273, 274, 275, 276, 277, 278, 280, 281, 282, 285, 288, 326, 327, 328, 344, 346, 347, 348, 357, 359, 361, 368, 371, 375, 376, 382, 383, 386, 389, 393, 394, ...], ('Cat', 'Died'): [841, 970, 983, 985], ('Cat', 'Euthanasia'): [0, 3, 185, 207, 209, 225, 243, 341, 720, 753, 768, 911], ('Cat', 'Return to Owner'): [114, 129, 176, 177, 228, 233, 269, 369, 401, 408, 430, 431, 435, 436, 462, 493, 497, 638, 715, 743, 822, 866, 884, 929], ('Cat', 'Rto-Adopt'): [141, 202], ('Cat', 'Transfer'): [7, 8, 27, 117, 118, 119, 134, 174, 175, 179, 231, 279, 335, 336, 337, 338, 339, 380, 381, 400, 411, 426, 530, 626, 627, 628, 681, 750, 751, 769, 770, 771, 772, 797, 801, 804, 895, 934], ('Dog', 'Adoption'): [1, 9, 13, 14, 15, 17, 19, 23, 25, 26, 31, 33, 34, 35, 38, 42, 43, 62, 64, 65, 66, 68, 70, 73, 75, 77, 78, 79, 82, 83, 84, 86, 91, 93, 97, 99, 101, 102, 103, 104, 105, 106, 107, 110, 111, 112, 113, 127, 128, 137, 138, 139, 142, 143, 144, 145, 146, 148, 149, 150, 153, 154, 156, 160, 164, 183, 184, 187, 188, 189, 191, 192, 194, 195, 196, 197, 198, 204, 205, 211, 212, 214, 220, 223, 232, 234, 235, 237, 241, 245, 246, 253, 254, 255, 256, 257, 259, 261, 263, 264, ...], ('Dog', 'Died'): [445, 448, 552], ('Dog', 'Disposal'): [447, 643], ('Dog', 'Euthanasia'): [6, 123, 200, 249, 374, 413, 432, 662, 665, 677, 736, 785, 909, 984], ('Dog', 'Return to Owner'): [11, 12, 29, 45, 55, 69, 71, 87, 108, 180, 190, 206, 216, 226, 227, 229, 230, 240, 270, 323, 333, 334, 340, 343, 350, 351, 353, 360, 365, 366, 367, 397, 423, 464, 484, 490, 517, 520, 521, 526, 534, 546, 548, 549, 563, 565, 570, 598, 605, 610, 614, 615, 621, 625, 653, 655, 658, 669, 676, 678, 679, 686, 691, 712, 718, 723, 731, 740, 744, 745, 765, 767, 778, 789, 791, 818, 839, 840, 865, 888, 890, 894, 917, 918, 919, 921, 922, 924, 931, 935, 938, 965, 966, 969, 973, 986], ('Dog', 'Rto-Adopt'): [63, 135, 181, 182, 236, 420, 441, 442, 663], ('Dog', 'Transfer'): [4, 5, 20, 24, 39, 40, 46, 51, 52, 53, 54, 60, 88, 89, 92, 94, 95, 116, 120, 121, 122, 124, 125, 126, 140, 147, 161, 162, 163, 172, 173, 186, 201, 208, 221, 283, 286, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 362, 363, 364, 405, 407, 410, 414, 415, 425, 439, 440, 443, 461, 467, 468, 492, 495, 525, 545, 553, 555, 556, 557, 558, 590, 591, 592, 593, 594, 600, 629, ...], ('Other', 'Adoption'): [16, 18, 168, 224, 252, 356, 358, 471, 477, 524, 607, 608, 831, 846, 871, 872, 875], ('Other', 'Died'): [762], ('Other', 'Euthanasia'): [96, 132, 238, 239, 248, 262, 372, 373, 396, 527, 554, 559, 560, 879], ('Other', 'Transfer'): [601, 602, 603, 604]}

In [29]:
# animal_outcome.groups is a dictionary, so we can access the group names using keys()
animal_outcome.groups.keys()

dict_keys([('Cat', 'Adoption'), ('Cat', 'Died'), ('Cat', 'Euthanasia'), ('Cat', 'Return to Owner'), ('Cat', 'Rto-Adopt'), ('Cat', 'Transfer'), ('Dog', 'Adoption'), ('Dog', 'Died'), ('Dog', 'Disposal'), ('Dog', 'Euthanasia'), ('Dog', 'Return to Owner'), ('Dog', 'Rto-Adopt'), ('Dog', 'Transfer'), ('Other', 'Adoption'), ('Other', 'Died'), ('Other', 'Euthanasia'), ('Other', 'Transfer')])

In [30]:
animals['animal_type'].value_counts()

Dog      600
Cat      364
Other     36
Name: animal_type, dtype: int64

In [31]:
animals['outcome_type'].value_counts()

Adoption           636
Transfer           183
Return to Owner    120
Euthanasia          40
Rto-Adopt           11
Died                 8
Disposal             2
Name: outcome_type, dtype: int64

In [32]:
# We can then get a specific group, such as cats that were adopted
animal_outcome.get_group(('Cat', 'Adoption'))

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
2,A845105,Widge,2022-01-18 08:15:00,2022-01-18T08:15:00.000,2013-10-25T00:00:00.000,Adoption,Foster,Cat,Spayed Female,8 years,Domestic Shorthair,Brown Tabby
10,A849862,William,2022-01-16 17:47:00,2022-01-16T17:47:00.000,2019-05-14T00:00:00.000,Adoption,NaN,Cat,Neutered Male,2 years,Domestic Shorthair,Blue
21,A849614,Punkie,2022-01-16 13:39:00,2022-01-16T13:39:00.000,2013-10-11T00:00:00.000,Adoption,NaN,Cat,Neutered Male,8 years,Domestic Shorthair,Orange Tabby
22,A848435,Meowi Bubbles,2022-01-16 13:39:00,2022-01-16T13:39:00.000,2005-12-20T00:00:00.000,Adoption,NaN,Cat,Spayed Female,16 years,Domestic Longhair Mix,Calico
28,A846329,*Femke,2022-01-16 11:27:00,2022-01-16T11:27:00.000,2021-09-29T00:00:00.000,Adoption,NaN,Cat,Spayed Female,3 months,Domestic Shorthair,Black
...,...,...,...,...,...,...,...,...,...,...,...,...
990,A847780,Daisy,2021-12-19 17:50:00,2021-12-19T17:50:00.000,2013-12-08T00:00:00.000,Adoption,NaN,Cat,Spayed Female,8 years,Domestic Shorthair Mix,Brown Tabby
992,A847866,A847866,2021-12-19 17:36:00,2021-12-19T17:36:00.000,2021-08-10T00:00:00.000,Adoption,NaN,Cat,Neutered Male,4 months,Domestic Shorthair,Brown Tabby
995,A845804,*Nutmeg,2021-12-19 15:30:00,2021-12-19T15:30:00.000,2021-09-29T00:00:00.000,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair,Brown Tabby
996,A845798,*Ginger,2021-12-19 15:27:00,2021-12-19T15:27:00.000,2021-09-29T00:00:00.000,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair,Black
998,A847392,*Dewey,2021-12-19 15:20:00,2021-12-19T15:20:00.000,2021-07-01T00:00:00.000,Adoption,NaN,Cat,Neutered Male,5 months,Domestic Medium Hair,Blue/White

## Aggregating

Once again, as we will see in SQL, groupby objects are intended to be used with aggregation. In SQL, we will see that our queries that include GROUP BY require aggregation performed on columns.

We can use `.sum()`, `.mean()`, `.count()`, `.max()`, `.min()`, etc. Find a list of common aggregations [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html).

In [33]:
animals.groupby('animal_type').count()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,sex_upon_outcome,age_upon_outcome,breed,color
animal_type,,,,,,,,,,,
Cat,364,324,364,364,364,364,126,364,364,364,364
Dog,600,535,600,600,600,600,202,600,600,600,600
Other,36,22,36,36,36,36,21,36,36,36,36

## Exercise

Use `.groupby()` to find the most recently born of each (main) animal type.

In [42]:
animals.groupby("animal_type")["date_of_birth"].max()

animal_type
Cat      2022-01-07T00:00:00.000
Dog      2022-01-10T00:00:00.000
Other    2021-11-12T00:00:00.000
Name: date_of_birth, dtype: object

<details>
    <summary>Answer</summary>

```python
animals.groupby('animal_type')['date_of_birth'].max()
```
</details>

# Pivoting a DataFrame

## `.pivot_table()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

Grouping by two different columns can be very helpful.

In [43]:
animals.groupby(by=['outcome_type', 'sex_upon_outcome']).agg(len)

                                  animal_id  name  datetime  monthyear  \
outcome_type    sex_upon_outcome
Adoption        Intact Female             9     9         9          9
                Intact Male              14    14        14         14
                Neutered Male           295   295       295        295
                Spayed Female           316   316       316        316
                Unknown                   2     2         2          2
Died            Intact Female             3     3         3          3
                Intact Male               5     5         5          5
Disposal        Intact Male               1     1         1          1
                Neutered Male             1     1         1          1
Euthanasia      Intact Female             6     6         6          6
                Intact Male              10    10        10         10
                Neutered Male             4     4         4          4
                Spayed Female             6     6         6          6
                Unknown                  14    14        14         14
Return to Owner Intact Female            20    20        20         20
                Intact Male              39    39        39         39
                Neutered Male            36    36        36         36
                Spayed Female            25    25        25         25
Rto-Adopt       Neutered Male             5     5         5          5
                Spayed Female             6     6         6          6
Transfer        Intact Female            56    56        56         56
                Intact Male              65    65        65         65
                Neutered Male            35    35        35         35
                Spayed Female            19    19        19         19
                Unknown                   8     8         8          8

                                  date_of_birth  outcome_subtype  animal_type  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                 9                9            9
                Intact Male                  14               14           14
                Neutered Male               295              295          295
                Spayed Female               316              316          316
                Unknown                       2                2            2
Died            Intact Female                 3                3            3
                Intact Male                   5                5            5
Disposal        Intact Male                   1                1            1
                Neutered Male                 1                1            1
Euthanasia      Intact Female                 6                6            6
                Intact Male                  10               10           10
                Neutered Male                 4                4            4
                Spayed Female                 6                6            6
                Unknown                      14               14           14
Return to Owner Intact Female                20               20           20
                Intact Male                  39               39           39
                Neutered Male                36               36           36
                Spayed Female                25               25           25
Rto-Adopt       Neutered Male                 5                5            5
                Spayed Female                 6                6            6
Transfer        Intact Female                56               56           56
                Intact Male                  65               65           65
                Neutered Male                35               35           35
                Spayed Female                19               19           19
                Unknown                       8                8            8

                                  age_upon_outcome  breed  color
outcome_type    sex_upon_outcome
Adoption        Intact Female                    9      9      9
                Intact Male                     14     14     14
                Neutered Male                  295    295    295
                Spayed Female                  316    316    316
                Unknown                          2      2      2
Died            Intact Female                    3      3      3
                Intact Male                      5      5      5
Disposal        Intact Male                      1      1      1
                Neutered Male                    1      1      1
Euthanasia      Intact Female                    6      6      6
                Intact Male                     10     10     10
                Neutered Male                    4      4      4
                Spayed Female                    6      6      6
                Unknown                         14     14     14
Return to Owner Intact Female                   20     20     20
                Intact Male                     39     39     39
                Neutered Male                   36     36     36
                Spayed Female                   25     25     25
Rto-Adopt       Neutered Male                    5      5      5
                Spayed Female                    6      6      6
Transfer        Intact Female                   56     56     56
                Intact Male                     65     65     65
                Neutered Male                   35     35     35
                Spayed Female                   19     19     19
                Unknown                          8      8      8

But it has the unsavory side effect of creating a two-level index. This can be a good time to use `.pivot_table()`.

(There is also a `.pivot()`. For the somewhat subtle differences, see [here](https://stackoverflow.com/questions/30960338/pandas-difference-between-pivot-and-pivot-table-why-is-only-pivot-table-workin).)

### Example

In [44]:
df = pd.DataFrame({"sex": ["male", "male", "male", "male", "male",
                          "female", "female", "female", "female"],
                    "num_puppies": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "breed": ["terrier", "retriever", "retriever", "terrier",
                          "terrier", "retriever", "terrier", "terrier",
                          "retriever"],
                    "past_owners": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "family_members": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

      sex num_puppies      breed  past_owners  family_members
0    male         one    terrier            1               2
1    male         one  retriever            2               4
2    male         one  retriever            2               5
3    male         two    terrier            3               5
4    male         two    terrier            3               6
5  female         one  retriever            4               6
6  female         one    terrier            5               8
7  female         two    terrier            6               9
8  female         two  retriever            7               9

In [45]:
# This first example aggregates values by taking the sum.

table = pd.pivot_table(df, values='past_owners', index=['sex', 'num_puppies'],
                     columns=['breed'], aggfunc=np.sum)
table

breed               retriever  terrier
sex    num_puppies
female one                4.0      5.0
       two                7.0      6.0
male   one                4.0      1.0
       two                NaN      6.0

### Back to Austin animals

In [46]:
animals.pivot_table(index='outcome_type', columns='sex_upon_outcome', aggfunc=len)

                 age_upon_outcome                                          \
sex_upon_outcome    Intact Female Intact Male Neutered Male Spayed Female
outcome_type
Adoption                      9.0        14.0         295.0         316.0
Died                          3.0         5.0           NaN           NaN
Disposal                      NaN         1.0           1.0           NaN
Euthanasia                    6.0        10.0           4.0           6.0
Return to Owner              20.0        39.0          36.0          25.0
Rto-Adopt                     NaN         NaN           5.0           6.0
Transfer                     56.0        65.0          35.0          19.0

                             animal_id                            \
sex_upon_outcome Unknown Intact Female Intact Male Neutered Male
outcome_type
Adoption             2.0           9.0        14.0         295.0
Died                 NaN           3.0         5.0           NaN
Disposal             NaN           NaN         1.0           1.0
Euthanasia          14.0           6.0        10.0           4.0
Return to Owner      NaN          20.0        39.0          36.0
Rto-Adopt            NaN           NaN         NaN           5.0
Transfer             8.0          56.0        65.0          35.0

                                        ...          name              \
sex_upon_outcome Spayed Female Unknown  ... Intact Female Intact Male
outcome_type                            ...
Adoption                 316.0     2.0  ...           9.0        14.0
Died                       NaN     NaN  ...           3.0         5.0
Disposal                   NaN     NaN  ...           NaN         1.0
Euthanasia                 6.0    14.0  ...           6.0        10.0
Return to Owner           25.0     NaN  ...          20.0        39.0
Rto-Adopt                  6.0     NaN  ...           NaN         NaN
Transfer                  19.0     8.0  ...          56.0        65.0

                                                     outcome_subtype  \
sex_upon_outcome Neutered Male Spayed Female Unknown   Intact Female
outcome_type
Adoption                 295.0         316.0     2.0             9.0
Died                       NaN           NaN     NaN             3.0
Disposal                   1.0           NaN     NaN             NaN
Euthanasia                 4.0           6.0    14.0             6.0
Return to Owner           36.0          25.0     NaN            20.0
Rto-Adopt                  5.0           6.0     NaN             NaN
Transfer                  35.0          19.0     8.0            56.0


sex_upon_outcome Intact Male Neutered Male Spayed Female Unknown
outcome_type
Adoption                14.0         295.0         316.0     2.0
Died                     5.0           NaN           NaN     NaN
Disposal                 1.0           1.0           NaN     NaN
Euthanasia              10.0           4.0           6.0    14.0
Return to Owner         39.0          36.0          25.0     NaN
Rto-Adopt                NaN           5.0           6.0     NaN
Transfer                65.0          35.0          19.0     8.0

[7 rows x 50 columns]

## Exercise

Use `.pivot_table()` to add up the number of my tasks by category. 

>  Hint: Use `sum()` as your aggregating function.

In [64]:
tasks = pd.DataFrame({'category': ['house', 'house', 'school', 'school'],
                      'descr': ['kitchen', 'laundry', 'git', 'Python'],
                      'priority': [2, 3, 4, 1], 'num_tasks': [2, 1, 2, 3]})

tasks

  category    descr  priority  num_tasks
0    house  kitchen         2          2
1    house  laundry         3          1
2   school      git         4          2
3   school   Python         1          3

In [65]:
task_pivot = pd.pivot_table(tasks, values = "num_tasks", index = "category" , aggfunc = sum)
task_pivot

          num_tasks
category
house             3
school            5

In [67]:
task_pivot2 = pd.pivot_table(tasks, values = "num_tasks", index = "category" , columns = "priority",aggfunc = sum)
task_pivot2 # if you want a breakdown by priority to show what the hell columns does

priority    1    2    3    4
category
house     NaN  2.0  1.0  NaN
school    3.0  NaN  NaN  2.0

<details>
    <summary>Answer</summary>

```python
tasks.pivot_table(values='num_tasks', index='category', aggfunc=sum)
```
</details>

# Methods for Combining DataFrames: `.join()`, `.merge()`, `pd.concat()`

## `.join()`

In [68]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'MP'])

toy1

   age   HP
0   63  142
1   33   47

In [69]:
toy2

   age   MP
0   63  100
1   33  200

In [71]:
# We can't just join these as they are, since we haven't specified our suffixes.

toy1.join(toy2)

ValueError: columns overlap but no suffix specified: Index(['age'], dtype='object')

In [72]:
toy1.join(toy2, lsuffix='1', rsuffix='2')

   age1   HP  age2   MP
0    63  142    63  100
1    33   47    33  200

If we don't want to keep both, we could set the overlapping column as the index in each DataFrame:

In [73]:
toy1.set_index('age').join(toy2.set_index('age'))

      HP   MP
age
63   142  100
33    47  200

In [74]:
toy1.drop('age', axis=1).join(toy2)

    HP  age   MP
0  142   63  100
1   47   33  200

For more on this method, check out the [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)!

## `.merge()`

Or we could use `.merge()`:

In [75]:
toy1.merge(toy2)

   age   HP   MP
0   63  142  100
1   33   47  200

In [76]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [77]:
states = pd.read_csv('data/states.csv', index_col=0)
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

## The `how` Parameter

This parameter in both `.join()` and `.merge()` tells the compiler what sort of join to effect. We'll cover this in detail when we discuss SQL.

In [78]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

In [79]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='outer')

     name     HP home_state state   nickname     capital
0    greg  200.0         WA    WA  evergreen     Olympia
1   miles  200.0         WA    WA  evergreen     Olympia
2    alan  170.0         TX    TX      alamo      Austin
3  rachel  200.0         TX    TX      alamo      Austin
4  alison  300.0         DC    DC   district  Washington
5     NaN    NaN        NaN    OH    buckeye    Columbus
6     NaN    NaN        NaN    OR     beaver       Salem

## `pd.concat()`

This method takes a *list* of pandas objects as arguments.

In [80]:
prefs = pd.read_csv('data/preferences.csv', index_col=0)
prefs

    cuisine        genre
0     Greek       horror
1    Indian        scifi
2  American      fantasy
3      Thai         tech
4    Indian  documentary

In [81]:
ds_full = pd.concat([ds_chars, prefs])
ds_full

     name     HP home_state   cuisine        genre
0    greg  200.0         WA       NaN          NaN
1   miles  200.0         WA       NaN          NaN
2    alan  170.0         TX       NaN          NaN
3  alison  300.0         DC       NaN          NaN
4  rachel  200.0         TX       NaN          NaN
0     NaN    NaN        NaN     Greek       horror
1     NaN    NaN        NaN    Indian        scifi
2     NaN    NaN        NaN  American      fantasy
3     NaN    NaN        NaN      Thai         tech
4     NaN    NaN        NaN    Indian  documentary

`pd.concat()`–– and many other pandas operations –– make use of an `axis` parameter. For this particular method I need to specify whether I want to concatenate the DataFrames *row-wise* (`axis=0`) or *column-wise* (`axis=1`). The default is `axis=0`, so let's override that!

In [82]:
ds_full = pd.concat([ds_chars, prefs], axis=1)
ds_full

     name   HP home_state   cuisine        genre
0    greg  200         WA     Greek       horror
1   miles  200         WA    Indian        scifi
2    alan  170         TX  American      fantasy
3  alison  300         DC      Thai         tech
4  rachel  200         TX    Indian  documentary

# King County Assessments

As data scientists, we want to build a model to predict the sale price of a house in Seattle in 2019, based on its square footage. We know that the King County Department of Assessments has comprehensive data available on real property sales in the Seattle area. We need to prepare the data.

## First, get the data!

Go [here](https://info.kingcounty.gov/assessor/DataDownload/default.aspx) and download two files: "Real Property Sales" and "Residential Building". Then unzip them. (Or you can run the cells below if you prefer.)

In [ ]:
# %%bash
# cd data
# curl -o property_sales.zip https://aqua.kingcounty.gov/extranet/assessor/Real%20Property%20Sales.zip

In [ ]:
# %%bash
# cd data
# curl -o res_bldg.zip https://aqua.kingcounty.gov/extranet/assessor/Residential%20Building.zip

In [ ]:
# zf = ZipFile('data/property_sales.zip', 'r')
# zf.extractall('data')
# zf.close()

In [ ]:
# zf = ZipFile('data/res_bldg.zip', 'r')
# zf.extractall('data')
# zf.close()

In [105]:
# You'll need to use a new encoding here. List of all encodings here:
# https://docs.python.org/3/library/codecs.html#standard-encodings

# Both of these csv files have many columns, so we'll just pre-select
# which ones we want to use.

sales_df = pd.read_csv('/Users/Nick/flatiron/phase_1/ds-aggregating_combining_dataframes-kbo33/data/EXTR_RPSale.csv',
                       encoding='latin-1',
                       usecols=['Major', 'Minor', 'DocumentDate', 'SalePrice'])

/Users/Nick/opt/anaconda3/envs/learn-env/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3145: DtypeWarning: Columns (1,2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [106]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2209125 entries, 0 to 2209124
Data columns (total 4 columns):
 #   Column        Dtype
---  ------        -----
 0   Major         object
 1   Minor         object
 2   DocumentDate  object
 3   SalePrice     int64
dtypes: int64(1), object(3)
memory usage: 67.4+ MB

In [107]:
bldg_df = pd.read_csv('/Users/Nick/flatiron/phase_1/ds-aggregating_combining_dataframes-kbo33/data/EXTR_ResBldg.csv',
                     usecols=['Major', 'Minor', 'SqFtTotLiving', 'ZipCode'])

/Users/Nick/opt/anaconda3/envs/learn-env/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3145: DtypeWarning: Columns (11) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [108]:
bldg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 521873 entries, 0 to 521872
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Major          521873 non-null  int64
 1   Minor          521873 non-null  int64
 2   ZipCode        470753 non-null  object
 3   SqFtTotLiving  521873 non-null  int64
dtypes: int64(3), object(1)
memory usage: 15.9+ MB

In [109]:
sales_data = pd.merge(sales_df, bldg_df, on=['Major', 'Minor'])

In [110]:
sales_data.head()

  Major Minor DocumentDate  SalePrice ZipCode  SqFtTotLiving
0  4000   228   04/29/1997     103500   98168           1560
1  4000   228   10/15/2014     221900   98168           1560
2  4000   228   08/28/2020          0   98168           1560
3  4000   228   05/06/2005     198000   98168           1560
4  4000   228   04/26/2019     369000   98168           1560

In [111]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1537897 entries, 0 to 1537896
Data columns (total 6 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   Major          1537897 non-null  object
 1   Minor          1537897 non-null  object
 2   DocumentDate   1537897 non-null  object
 3   SalePrice      1537897 non-null  int64
 4   ZipCode        1398045 non-null  object
 5   SqFtTotLiving  1537897 non-null  int64
dtypes: int64(2), object(4)
memory usage: 82.1+ MB

We can see right away that we're missing ZIP codes for many of the sales transactions.

In [112]:
sales_data.loc[sales_data['ZipCode'].isna()].head()

     Major Minor DocumentDate  SalePrice ZipCode  SqFtTotLiving
29  226700   160   05/08/2003          0     NaN           1560
30  226700   160   05/11/1996          0     NaN           1560
31  226700   160   09/08/2011          0     NaN           1560
32  226700   160   10/09/2018     855000     NaN           1560
33  226700   160   01/24/2020          0     NaN           1560

## Exercise

What percentage of housing records are missing ZIP codes?

In [117]:
sales_data["ZipCode"].isna().sum()/sales_data.shape[0]

0.09093716939430924

<details>
    <summary>Answer</summary>

```python
sales_data['ZipCode'].isna().sum() / sales_data.shape[0]
```
</details>

Let's drop the rows with missing zip codes.

In [118]:
sales_data = sales_data.loc[~sales_data['ZipCode'].isna(), :]

sales_data.head()

  Major Minor DocumentDate  SalePrice ZipCode  SqFtTotLiving
0  4000   228   04/29/1997     103500   98168           1560
1  4000   228   10/15/2014     221900   98168           1560
2  4000   228   08/28/2020          0   98168           1560
3  4000   228   05/06/2005     198000   98168           1560
4  4000   228   04/26/2019     369000   98168           1560

# Time Permitting: Data Cleaning Exercises with Pandas

## Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.

In [120]:
sales_data = sales_data[sales_data['SalePrice'] > 10000]
sales_data

          Major Minor DocumentDate  SalePrice ZipCode  SqFtTotLiving
0          4000   228   04/29/1997     103500   98168           1560
1          4000   228   10/15/2014     221900   98168           1560
3          4000   228   05/06/2005     198000   98168           1560
4          4000   228   04/26/2019     369000   98168           1560
7        799671   190   07/25/2006     387000   98133           1780
...         ...   ...          ...        ...     ...            ...
1537889  408330  4350   11/10/1997     160000   98103           2170
1537891  737960    40   10/28/1991     157000   98007           1750
1537893  388580  4261   05/19/2006    1050000   98033           4850
1537894  751850  6330   08/15/1986      64000   98117           1700
1537896  173680   760   01/03/1994     165000   98007           2130

[911117 rows x 6 columns]

<details>
    <summary>One possible answer here</summary>

```python
sales_data = sales_data[sales_data['SalePrice'] > 10000]
```
</details>

## Investigate and handle non-numeric ZipCode values

Can you find a way to shorten ZIP+4 codes to the first five digits?

In [123]:
def is_integer(x):
    try:
        _ = int(x)
    except ValueError:
        return False
    return True

sales_data.loc[sales_data['ZipCode'].apply(is_integer) == False, 'ZipCode'].head()

480964          # 3
480968          # 3
744599
744601
1309456    D1 south
Name: ZipCode, dtype: object

In [124]:
def five_digit_ZIP(x):
    try:
        return int(str(x)[:5])
    except:
        return x
    
sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digit_ZIP)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)

<ipython-input-124-301acdfb4748>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_data['ZipCode'] = sales_data['ZipCode'].map(int)

<details>
    <summary>One possible answer here</summary>

```python
def five_digit_ZIP(x):
    try:
        return int(str(x)[:5])
    except:
        return x
    
sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digit_ZIP)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)
```
</details>

## Add a column for PricePerSqFt

In [125]:
sales_data["PricePerSqFt"] =  sales_data['SalePrice'] / sales_data['SqFtTotLiving']

<ipython-input-125-9319db1e928e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_data["PricePerSqFt"] =  sales_data['SalePrice'] / sales_data['SqFtTotLiving']

<details>
    <summary>Answer here</summary>

```python
sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']
```
</details>

## Subset the data to 2021 sales only

We can assume that the DocumentDate is approximately the sale date.

In [127]:
sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']

<ipython-input-127-9f566238afb7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])

<details>
    <summary>Answer here</summary>

```python
sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']
```
</details>

## What is the mean price per square foot for a house sold in Seattle in 2021?

In [128]:
sales_data["PricePerSqFt"].mean()

514.6201965876984

<details>
    <summary>Answer here</summary>

```python
sales_data['PricePerSqFt'].mean()
```
</details>

# Level Up: `pandas.set_option()`

We can adjust how `pandas` works by setting options in advance.

For complete documentation, see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html).

## Block Scientific Notation

For example, suppose we want to prevent numbers from being displayed in scientific notation.

In [101]:
df = pd.DataFrame([[1e9, 2e9], [3e9, 4e9]])
df

              0             1
0  1.000000e+09  2.000000e+09
1  3.000000e+09  4.000000e+09

Then we can use:

In [102]:
pd.set_option('display.float_format', '{:.2f}'.format)

df

              0             1
0 1000000000.00 2000000000.00
1 3000000000.00 4000000000.00

## See More Rows

Or suppose we want `pandas` to show more rows.

In [103]:
df2 = pd.DataFrame(np.array(range(100)))
df2

     0
0    0
1    1
2    2
3    3
4    4
..  ..
95  95
96  96
97  97
98  98
99  99

[100 rows x 1 columns]

In that case we can use:

In [104]:
pd.set_option('display.max_rows', 100)

df2

     0
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11
12  12
13  13
14  14
15  15
16  16
17  17
18  18
19  19
20  20
21  21
22  22
23  23
24  24
25  25
26  26
27  27
28  28
29  29
30  30
31  31
32  32
33  33
34  34
35  35
36  36
37  37
38  38
39  39
40  40
41  41
42  42
43  43
44  44
45  45
46  46
47  47
48  48
49  49
50  50
51  51
52  52
53  53
54  54
55  55
56  56
57  57
58  58
59  59
60  60
61  61
62  62
63  63
64  64
65  65
66  66
67  67
68  68
69  69
70  70
71  71
72  72
73  73
74  74
75  75
76  76
77  77
78  78
79  79
80  80
81  81
82  82
83  83
84  84
85  85
86  86
87  87
88  88
89  89
90  90
91  91
92  92
93  93
94  94
95  95
96  96
97  97
98  98
99  99